In [1]:
import pandas as pd
import requests
from io import StringIO

In [2]:
url='https://raw.githubusercontent.com/plotly/datasets/master/data.csv'
req=requests.get(url)
data=StringIO(req.text)
df=pd.read_csv(data)
df.head()

,SeriousDlqin2yrs,RevolvingUtilizationOfUnsecuredLines,age,NumberOfTime30-59DaysPastDueNotWorse,DebtRatio,MonthlyIncome,NumberOfOpenCreditLinesAndLoans,NumberOfTimes90DaysLate,NumberRealEstateLoansOrLines,NumberOfTime60-89DaysPastDueNotWorse,NumberOfDependents
0,1,0.766127,45,2,0.802982,9120.0,13,0,6,0,2.0
1,0,0.957151,40,0,0.121876,2600.0,4,0,0,0,1.0
2,0,0.658180,38,1,0.085113,3042.0,2,1,0,0,0.0
3,0,0.233810,30,0,0.036050,3300.0,5,0,0,0,0.0
4,0,0.907239,49,1,0.024926,63588.0,7,0,1,0,0.0

# working with TSV file

In [3]:
url='https://raw.githubusercontent.com/ibm-watson-data-lab/open-data/master/movies/movies.tsv'
req=requests.get(url)
data=StringIO(req.text)
df=pd.read_csv(data,sep='\t')
df.head()

       id             name  year rating  runtime    genre earnings_rank
0  499549           Avatar  2009   PG13      162  A,V,Y,S             1
1  120338          Titanic  1997   PG13      194      D,R             2
2  848228     The Avengers  2012   PG13      143        A             3
3  468569  The Dark Knight  2008   PG13      152      A,T             4
4   76759        Star Wars  1977     PG      121  A,V,Y,S             5

In [4]:
url='https://raw.githubusercontent.com/eugenelin89/recommender_content_based/master/data/movie-titles.csv'
req=requests.get(url)
data=StringIO(req.text)
df=pd.read_csv(data,names=['S no','Movie_names'])
df.head()

   S no                                        Movie_names
0    11         Star Wars: Episode IV - A New Hope (1977)"
1    12                               Finding Nemo (2003)"
2    13                               Forrest Gump (1994)"
3    14                            American Beauty (1999)"
4    22  Pirates of the Caribbean: The Curse of the Bla...

# index_col_perameter

In [5]:
url='https://raw.githubusercontent.com/eugenelin89/recommender_content_based/master/data/movie-titles.csv'
req=requests.get(url)
data=StringIO(req.text)
df=pd.read_csv(data,names=['S no','Movie_names'],index_col='S no')
df.head()

                                            Movie_names
S no
11           Star Wars: Episode IV - A New Hope (1977)"
12                                 Finding Nemo (2003)"
13                                 Forrest Gump (1994)"
14                              American Beauty (1999)"
22    Pirates of the Caribbean: The Curse of the Bla...

# Header_perameter

In [6]:
# pd.read+csv(data,header=1) convert ist row into column names

# use_cols permeter

In [7]:
# pd.read+csv(data,usecols=['','']) will get only those columns which you want

# squeeze perameter

In [8]:
# pd.read+csv(data,usecols=[''],squeeze=True) will get only one colum as a Series

# skiprows/nrow

In [9]:
# pd.read+csv(data,skiprows=[2,3,5]) will skip the given rows

# Encoding perameter

In [10]:
# pd.read+csv(data,encoding='latin-1') if the encoding is not utf-8, it give utfencode error.

# Skip bad lines

In [11]:
# pd.read+csv(data,sep=',',encoding='latin-1',error_bad_lines=False) if there are different lines in different rows, it give error

# Dtypes perameter

In [ ]:
# pd.read+csv(data,dtype={'colmn_name':'int'}) change the dtype of columns

# Handling dates

In [ ]:
# pd.read+csv(data,parse_date=['date column name']) change the dtype of columns

# Convertors

In [13]:
def rename(name):
    if name=='peshawar zalmi':
        return 'PZ'
    if name=='lahore qalarndar':
        return 'LQ'
    else:
        return name

In [ ]:
# pd.read+csv(data,converters={'column name':function name}) will apply function name to the column name

# na_values perameters

In [ ]:
# pd.read+csv(data,na_values=['male']) convert all the male word into NAN in csv file. it is
# use to convert all the values which are NaN. for example there is - . you can convert - into NaN

# loading huge datasets in chunks

In [ ]:
#dfs= pd.read+csv(data,chunksize=1000) it will convert the whole into 1000 of chucks
# now you need to loop through data to apply any operations

# for chuck in dfs:
#     print(chunk.shape)